Revit 2024 API
BuiltInFailures.DimensionFailures.RadialDimensionChangeRadiusFailed Property
 Can't change radius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RadialDimensionChangeRadiusFailed { get; }
Visual Basic
Public Shared ReadOnly Property RadialDimensionChangeRadiusFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RadialDimensionChangeRadiusFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace